tutorials/combustion/fireFoam/les/oppositeBurningPanels/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    ground
    {
        type            fixedValue;
        value           $internalField;
    }

    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    burner
    {
        type            flowRateInletVelocity;
        flowRate        0.001294;     //60kW  C3H8
        value           uniform (0 0 0);
    }

    sides
    {
        type            pressureInletOutletVelocity;
        phi             phi;
        value           $internalField;
    }

    "(region0_to.*)"
    {
        type            directMappedFlowRate;
        phi             phi;
        nbrPhi          phiGas;
        rho             rho;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
